# UISaveAsOptions Class

---
This class contains UI options available for saving a document to disk with a new filename.
SystemObject Autodesk.Revit.UIUISaveAsOptions
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class UISaveAsOptions : IDisposable

    Public Class UISaveAsOptions
    	Implements IDisposable

    public ref class UISaveAsOptions : IDisposable

    type UISaveAsOptions =
        class
            interface IDisposable
        end
The UISaveAsOptions type exposes the following members.
| Name| Description
---|---|---
| UISaveAsOptions|  Default constructor.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| ShowOverwriteWarning|  Identifies if UI should show an overwrite warning dialog.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the UISaveAsOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.UI Namespace